susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32G05x.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2023-12-12T18:58:56.262534
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define COMP1_OUT_PB0_ PB0,GPIO_AF7
#define COMP1_OUT_PB10_ PB10,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA6_ 1
#define _COMP1_OUT_PB0_ 1
#define _COMP1_OUT_PB10_ 1

#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define COMP2_OUT_PB11_ PB11,GPIO_AF7
#define COMP2_OUT_PB5_ PB5,GPIO_AF7
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1
#define _COMP2_OUT_PB11_ 1
#define _COMP2_OUT_PB5_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF7
#define EVENTOUT_PA10_ PA10,GPIO_AF7
#define EVENTOUT_PA13_ PA13,GPIO_AF7
#define EVENTOUT_PA14_ PA14,GPIO_AF7
#define EVENTOUT_PA15_ PA15,GPIO_AF7
#define EVENTOUT_PA3_ PA3,GPIO_AF7
#define EVENTOUT_PA4_ PA4,GPIO_AF7
#define EVENTOUT_PA5_ PA5,GPIO_AF7
#define EVENTOUT_PA8_ PA8,GPIO_AF7
#define EVENTOUT_PA9_ PA9,GPIO_AF7
#define EVENTOUT_PB1_ PB1,GPIO_AF7
#define EVENTOUT_PB12_ PB12,GPIO_AF7
#define EVENTOUT_PB13_ PB13,GPIO_AF7
#define EVENTOUT_PB14_ PB14,GPIO_AF7
#define EVENTOUT_PB15_ PB15,GPIO_AF7
#define EVENTOUT_PB2_ PB2,GPIO_AF7
#define EVENTOUT_PB3_ PB3,GPIO_AF7
#define EVENTOUT_PB4_ PB4,GPIO_AF7
#define EVENTOUT_PB6_ PB6,GPIO_AF7
#define EVENTOUT_PB7_ PB7,GPIO_AF7
#define EVENTOUT_PB8_ PB8,GPIO_AF7
#define EVENTOUT_PB9_ PB9,GPIO_AF7
#define EVENTOUT_PD0_ PD0,GPIO_AF0
#define EVENTOUT_PD1_ PD1,GPIO_AF0
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA13_ 1
#define _EVENTOUT_PA14_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PD0_ 1
#define _EVENTOUT_PD1_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF6
#define I2C1_SCL_PB6_ PB6,GPIO_AF6
#define I2C1_SCL_PB8_ PB8,GPIO_AF6
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF6
#define I2C1_SDA_PB7_ PB7,GPIO_AF6
#define I2C1_SDA_PB9_ PB9,GPIO_AF6
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF6
#define I2C1_SMBA_PB5_ PB5,GPIO_AF6
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF6
#define I2C2_SCL_PB13_ PB13,GPIO_AF6
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF6
#define I2C2_SDA_PB14_ PB14,GPIO_AF6
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2S1_CK_PA1_ PA1,GPIO_AF0
#define I2S1_CK_PA5_ PA5,GPIO_AF0
#define I2S1_CK_PB3_ PB3,GPIO_AF0
#define _I2S1_CK_PA1_ 1
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1

#define I2S1_MCK_PA6_ PA6,GPIO_AF0
#define I2S1_MCK_PB4_ PB4,GPIO_AF0
#define _I2S1_MCK_PA6_ 1
#define _I2S1_MCK_PB4_ 1

#define I2S1_SD_PA2_ PA2,GPIO_AF0
#define I2S1_SD_PA7_ PA7,GPIO_AF0
#define I2S1_SD_PB5_ PB5,GPIO_AF0
#define _I2S1_SD_PA2_ 1
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF0
#define I2S1_WS_PA4_ PA4,GPIO_AF0
#define I2S1_WS_PB0_ PB0,GPIO_AF0
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PB0_ 1


#define IR_OUT_PA13_ PA13,GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF0
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF5
#define _LPTIM1_ETR_PB6_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF5
#define _LPTIM1_IN1_PB5_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF5
#define _LPTIM1_IN2_PB7_ 1

#define LPTIM1_OUT_PA0_ PA0,GPIO_AF5
#define LPTIM1_OUT_PB0_ PB0,GPIO_AF5
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF5
#define _LPTIM1_OUT_PA0_ 1
#define _LPTIM1_OUT_PB0_ 1
#define _LPTIM1_OUT_PB2_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF5
#define _LPTIM2_ETR_PA5_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF5
#define _LPTIM2_IN1_PB1_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF5
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF5
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF6
#define LPUART1_CTS_PB13_ PB13,GPIO_AF1
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF6
#define LPUART1_DE_PB12_ PB12,GPIO_AF1
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF6
#define LPUART1_RTS_PB12_ PB12,GPIO_AF1
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF6
#define LPUART1_RX_PB10_ PB10,GPIO_AF1
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF6
#define LPUART1_TX_PB11_ PB11,GPIO_AF1
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PA9_ PA9,GPIO_AF0
#define RCC_MCO_PF2_ PF2,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PA9_ 1
#define _RCC_MCO_PF2_ 1

#define RCC_OSC32_EN_PC15_ PC15,GPIO_AF0
#define _RCC_OSC32_EN_PC15_ 1

#define RCC_OSC_EN_PC15_ PC15,GPIO_AF1
#define RCC_OSC_EN_PF1_ PF1,GPIO_AF0
#define _RCC_OSC_EN_PC15_ 1
#define _RCC_OSC_EN_PF1_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA2_ PA2,GPIO_AF0
#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define _SPI1_MOSI_PA2_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define SPI1_NSS_PB0_ PB0,GPIO_AF0
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB0_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF0
#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PA3_ PA3,GPIO_AF0
#define SPI2_MISO_PA9_ PA9,GPIO_AF4
#define SPI2_MISO_PB14_ PB14,GPIO_AF0
#define SPI2_MISO_PB2_ PB2,GPIO_AF1
#define SPI2_MISO_PB6_ PB6,GPIO_AF4
#define SPI2_MISO_PD3_ PD3,GPIO_AF1
#define _SPI2_MISO_PA3_ 1
#define _SPI2_MISO_PA9_ 1
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PB2_ 1
#define _SPI2_MISO_PB6_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PA10_ PA10,GPIO_AF0
#define SPI2_MOSI_PA4_ PA4,GPIO_AF1
#define SPI2_MOSI_PB11_ PB11,GPIO_AF0
#define SPI2_MOSI_PB15_ PB15,GPIO_AF0
#define SPI2_MOSI_PB7_ PB7,GPIO_AF1
#define _SPI2_MOSI_PA10_ 1
#define _SPI2_MOSI_PA4_ 1
#define _SPI2_MOSI_PB11_ 1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PB7_ 1

#define SPI2_NSS_PA8_ PA8,GPIO_AF1
#define SPI2_NSS_PB12_ PB12,GPIO_AF0
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF1
#define _SPI2_NSS_PA8_ 1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PA0_ PA0,GPIO_AF0
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF0
#define SPI2_SCK_PB8_ PB8,GPIO_AF1
#define SPI2_SCK_PD1_ PD1,GPIO_AF1
#define _SPI2_SCK_PA0_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PB8_ 1
#define _SPI2_SCK_PD1_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define TIM14_CH1_PA4_ PA4,GPIO_AF4
#define TIM14_CH1_PA7_ PA7,GPIO_AF4
#define TIM14_CH1_PB1_ PB1,GPIO_AF0
#define TIM14_CH1_PF0_ PF0,GPIO_AF2
#define _TIM14_CH1_PA4_ 1
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PB1_ 1
#define _TIM14_CH1_PF0_ 1

#define TIM15_BK_PB12_ PB12,GPIO_AF5
#define TIM15_BK_PB8_ PB8,GPIO_AF5
#define TIM15_BK_PC15_ PC15,GPIO_AF2
#define _TIM15_BK_PB12_ 1
#define _TIM15_BK_PB8_ 1
#define _TIM15_BK_PC15_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF5
#define TIM15_CH1_PB14_ PB14,GPIO_AF5
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF5
#define TIM15_CH1N_PB13_ PB13,GPIO_AF5
#define TIM15_CH1N_PB15_ PB15,GPIO_AF4
#define TIM15_CH1N_PF1_ PF1,GPIO_AF2
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB13_ 1
#define _TIM15_CH1N_PB15_ 1
#define _TIM15_CH1N_PF1_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF5
#define TIM15_CH2_PB15_ PB15,GPIO_AF5
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1

#define TIM16_BK_PB5_ PB5,GPIO_AF2
#define _TIM16_BK_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF5
#define TIM16_CH1_PB8_ PB8,GPIO_AF2
#define TIM16_CH1_PD0_ PD0,GPIO_AF2
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PD0_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF2
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BK_PA10_ PA10,GPIO_AF5
#define TIM17_BK_PB4_ PB4,GPIO_AF5
#define _TIM17_BK_PA10_ 1
#define _TIM17_BK_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF5
#define TIM17_CH1_PB9_ PB9,GPIO_AF2
#define TIM17_CH1_PD1_ PD1,GPIO_AF2
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PD1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF2
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BK_PA6_ PA6,GPIO_AF2
#define TIM1_BK_PB12_ PB12,GPIO_AF2
#define TIM1_BK_PC13_ PC13,GPIO_AF2
#define _TIM1_BK_PA6_ 1
#define _TIM1_BK_PB12_ 1
#define _TIM1_BK_PC13_ 1

#define TIM1_BK2_PC14_ PC14,GPIO_AF2
#define _TIM1_BK2_PC14_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF2
#define _TIM1_CH1_PA8_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF2
#define TIM1_CH1N_PB13_ PB13,GPIO_AF2
#define TIM1_CH1N_PD2_ PD2,GPIO_AF2
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PD2_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF2
#define TIM1_CH2_PB3_ PB3,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PB3_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF2
#define TIM1_CH2N_PB14_ PB14,GPIO_AF2
#define TIM1_CH2N_PD3_ PD3,GPIO_AF2
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PD3_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF2
#define TIM1_CH3_PB6_ PB6,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PB6_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF2
#define TIM1_CH3N_PB15_ PB15,GPIO_AF2
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1



#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF2
#define TIM2_CH1_PA5_ PA5,GPIO_AF2
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB10_ PB10,GPIO_AF2
#define TIM2_CH3_PC6_ PC6,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1
#define _TIM2_CH3_PC6_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB11_ PB11,GPIO_AF2
#define TIM2_CH4_PC7_ PC7,GPIO_AF2
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1
#define _TIM2_CH4_PC7_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF2
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF1
#define TIM3_CH1_PB4_ PB4,GPIO_AF1
#define TIM3_CH1_PC6_ PC6,GPIO_AF1
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF1
#define TIM3_CH2_PB5_ PB5,GPIO_AF1
#define TIM3_CH2_PC7_ PC7,GPIO_AF1
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF1
#define _TIM3_CH3_PB0_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF1
#define _TIM3_CH4_PB1_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF1
#define _TIM3_ETR_PD2_ 1

#define UART1_CK_PB3_ PB3,GPIO_AF4
#define _UART1_CK_PB3_ 1

#define UART1_CTS_PB4_ PB4,GPIO_AF4
#define _UART1_CTS_PB4_ 1

#define UART1_DE_PB3_ PB3,GPIO_AF4
#define _UART1_DE_PB3_ 1

#define UART1_NSS_PB4_ PB4,GPIO_AF4
#define _UART1_NSS_PB4_ 1

#define UART1_RTS_PB3_ PB3,GPIO_AF4
#define _UART1_RTS_PB3_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF1
#define UART1_RX_PB7_ PB7,GPIO_AF0
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF1
#define UART1_TX_PB6_ PB6,GPIO_AF0
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA1_ PA1,GPIO_AF1
#define _UART2_CK_PA1_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF1
#define UART2_CTS_PD3_ PD3,GPIO_AF0
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF1
#define _UART2_DE_PA1_ 1

#define UART2_NSS_PA0_ PA0,GPIO_AF1
#define UART2_NSS_PD3_ PD3,GPIO_AF0
#define _UART2_NSS_PA0_ 1
#define _UART2_NSS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF1
#define _UART2_RTS_PA1_ 1

#define UART2_RX_PA15_ PA15,GPIO_AF1
#define UART2_RX_PA3_ PA3,GPIO_AF1
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF1
#define UART2_TX_PA2_ PA2,GPIO_AF1
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF6
#define UART3_CTS_PB13_ PB13,GPIO_AF1
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1

#define UART3_DE_PB1_ PB1,GPIO_AF6
#define UART3_DE_PB12_ PB12,GPIO_AF1
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB12_ 1

#define UART3_RTS_PB1_ PB1,GPIO_AF6
#define UART3_RTS_PB12_ PB12,GPIO_AF1
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB12_ 1

#define UART3_RX_PA3_ PA3,GPIO_AF6
#define UART3_RX_PB10_ PB10,GPIO_AF1
#define _UART3_RX_PA3_ 1
#define _UART3_RX_PB10_ 1

#define UART3_TX_PA2_ PA2,GPIO_AF6
#define UART3_TX_PB11_ PB11,GPIO_AF1
#define _UART3_TX_PA2_ 1
#define _UART3_TX_PB11_ 1



#define USART1_CK_PB3_ PB3,GPIO_AF4
#define _USART1_CK_PB3_ 1

#define USART1_CTS_PB4_ PB4,GPIO_AF4
#define _USART1_CTS_PB4_ 1

#define USART1_DE_PB3_ PB3,GPIO_AF4
#define _USART1_DE_PB3_ 1

#define USART1_NSS_PB4_ PB4,GPIO_AF4
#define _USART1_NSS_PB4_ 1

#define USART1_RTS_PB3_ PB3,GPIO_AF4
#define _USART1_RTS_PB3_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF1
#define USART1_RX_PB7_ PB7,GPIO_AF0
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF1
#define USART1_TX_PB6_ PB6,GPIO_AF0
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA1_ PA1,GPIO_AF1
#define _USART2_CK_PA1_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF1
#define USART2_CTS_PD3_ PD3,GPIO_AF0
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF1
#define _USART2_DE_PA1_ 1

#define USART2_NSS_PA0_ PA0,GPIO_AF1
#define USART2_NSS_PD3_ PD3,GPIO_AF0
#define _USART2_NSS_PA0_ 1
#define _USART2_NSS_PD3_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF1
#define _USART2_RTS_PA1_ 1

#define USART2_RX_PA15_ PA15,GPIO_AF1
#define USART2_RX_PA3_ PA3,GPIO_AF1
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF1
#define USART2_TX_PA2_ PA2,GPIO_AF1
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */